app/Controllers/UserController.php

    public function updateAccount() {
        $this->load->requireMethod('userAccount');
        $data = [
            'userId' => $this->load->session->get('user_id'),
            'pfp' => $this->request->getFile('pfp'),
            'username' => $this->request->getPost('username'),
            'firstname' => $this->request->getPost('firstname'),
            'lastname' => $this->request->getPost('lastname'),
            'email' => $this->request->getPost('email'),
            'phone' => $this->request->getPost('phonenumber'),
            'address' => $this->request->getPost('address'),
            'citymunicipality' => $this->request->getPost('cityMunicipality'),
            'zipcode' => $this->request->getPost('zipcode'),
            'country' =>  $this->request->getPost('country'),
            'cpass' =>  $this->request->getPost('currentPass'),
            'npass' => $this->request->getPost('newPass')
        ];
         ## change profile picture
        if(!empty($data['pfp']) && $data['pfp']->isValid()) {
            $dataPfp['profile_pic'] = file_get_contents($data['pfp']->getTempName());
            $this->load->userAccount->update($data['userId'], $dataPfp);
---
UPDATE `user_accounts` SET `firstname` = 'Chris Wendell'
WHERE `user_accounts`.`user_id` IN ('1')

        }
        ## change lastname
        if(isset($data['lastname'])) {
            $this->load->userAccount->update($data['userId'], ['lastname' => $data['lastname']]);
        }
        ## change email
        if(isset($data['email'])) {
            $this->load->userAccount->update($data['userId'], ['email' => $data['email']]);
        }
        ## change phone number
        if(isset($data['phone'])) {
            $this->load->userAccount->update($data['userId'], ['phone_number' => $data['phone']]);
        }
        ## change home address
        if(isset($data['address'])) {
            $this->load->userAccount->update($data['userId'], ['address' => $data['address']]);
        }
        ## change state/city/municipality
        if(isset($data['citymunicipality'])) {
            $this->load->userAccount->update($data['userId'], ['city_municipality' =>  $data['citymunicipality']] );
        }
        ## change zipcode
        if(isset($data['zipcode'])) {
            $this->load->userAccount->update($data['userId'], ['zipcode'=> $data['zipcode']]);
        }
        ## change country
        if(isset($data['country'])) {
            $this->load->userAccount->update($data['userId'], ['country'=> $data['country']]);
---
UPDATE `user_accounts` SET `lastname` = 'Afable'
WHERE `user_accounts`.`user_id` IN ('1')
UPDATE `user_accounts` SET `email` = 'flaviano.chriswendell105@gmail.com'
WHERE `user_accounts`.`user_id` IN ('1')
UPDATE `user_accounts` SET `phone_number` = '09926636299'
WHERE `user_accounts`.`user_id` IN ('1')
UPDATE `user_accounts` SET `address` = 'blk 100, lot 14, ph 5'
WHERE `user_accounts`.`user_id` IN ('1')
UPDATE `user_accounts` SET `city_municipality` = 'Imus, Cavite'
WHERE `user_accounts`.`user_id` IN ('1')
UPDATE `user_accounts` SET `zipcode` = '4109'
WHERE `user_accounts`.`user_id` IN ('1')
UPDATE `user_accounts` SET `country` = 'Japan'
WHERE `user_accounts`.`user_id` IN ('1')


                $hashedPassword = password_hash($data['npass'], PASSWORD_DEFAULT);

                $this->load->userAccount->update($data['userId'], ['password' => $hashedPassword]);
---
UPDATE `user_accounts` SET `password` = '$2y$10$H8cQOfoq0Fn5Ct532jt3Ju9cpgEsLwNhiinwuwUKWJDn1RSEDS2li'
WHERE `user_accounts`.`user_id` IN ('1')