app/Models/Admin_Account_Model.php

    public function getAll()
    {
        return $this->findAll();
---
SELECT *
FROM `admin_accounts`
WHERE `admin_account_id` = '1'
 LIMIT 1

    public function getUser($field, $toGet)
    {
        return $this->where($field, $toGet)->first();
---
SELECT *
FROM `admin_accounts`
WHERE `admin_account_id` = '3'
 LIMIT 1