app/Models/admin_account_model.php

    public function checkUsername($username)
    {
        return $this->where('username', $username)->first();
---
SELECT *
FROM `admin_accounts`
WHERE `username` = 'admin'
 LIMIT 1

    public function checkEmail($email)
    {
        return $this->where('email', $email)->first();
---
SELECT *
FROM `admin_accounts`
WHERE `email` = 'admin'
 LIMIT 1