app/Models/Cart_Item_Model.php

    public function getCartItems($userId)
    {
        return $this->db->table('cart_items')
            ->select('cart_items.*, products.product_name, products.price, products.image_url')
            ->join('carts', 'carts.cart_id = cart_items.cart_id')
            ->join('products', 'products.product_id = cart_items.product_id')
            ->where('carts.user_id', $userId)
            ->get()
            ->getResultArray();
---
SELECT `cart_items`.*, `products`.`product_name`, `products`.`price`, `products`.`image_url`
FROM `cart_items`
JOIN `carts` ON `carts`.`cart_id` = `cart_items`.`cart_id`
JOIN `products` ON `products`.`product_id` = `cart_items`.`product_id`
WHERE `carts`.`user_id` = '1'