app/Models/Cart_Item_Model.php

SELECT *
FROM `cart_items`
WHERE `cart_id` = '7'
AND `product_id` = '32'
 LIMIT 1
---
    public function checkIfProductIsExisting($cart_id, $product_id)
    {
        return $this->where('cart_id', $cart_id)->where('product_id', $product_id)->first();

INSERT INTO `cart_items` (`cart_id`, `product_id`, `quantity`) VALUES ('7', '32', '3')
---
    public function addProduct($cart_id, $product_id, $quantity)
    {
        return $this->insert([
            'cart_id' => $cart_id,
            'product_id' => $product_id,
            'quantity' => $quantity
        ]);