app/Models/Cart_Model.php

SELECT *
FROM `carts`
WHERE `user_id` = '1'
 LIMIT 1
---
    public function checkIfCartisActive($user_id, $session_id)
    {
        return $this->where($user_id, $session_id)->first();