app/Models/category_table_model.php

SELECT *
FROM `category`
---
    public function getcategories()
    {
        return $this->findAll();