app/Models/Comments_Model.php

DELETE FROM `comments`
WHERE `user_id` = '1'
AND `product_id` = '2'
---
    public function deleteReview($userId, $productId) {
        return $this->where('user_id', $userId)
                    ->where('product_id', $productId)
                    ->delete();