app/Models/Gear_Product_Model.php

SELECT COUNT(*) AS `numrows` FROM `products`
---
    public function countAllGears(){
        return $this->db->table('products')->countAll();

SELECT *
FROM `products`
---
    public function getAll() {
        return $this->findAll();