app/Models/Transaction_Model.php

SELECT *
FROM `transactions`
---
    public function getAll()
    {
        return $this->findAll();