app/Models/user_account_model.php

    public function checkEmail($email) {
        return $this->where('email', $email)->first();
---
SELECT *
FROM `user_accounts`
WHERE `email` = 'flaviano.chriswendell105@gmail.com'
 LIMIT 1